class BotMessages:
    INFO = "Текст с общей информацией о VIP-канале."
    TARIFF_INFO = "Текст с ценами и тарифами к оплате"
    NO_PERMISSION = "Недостаточно прав для данного действия. Воспользуйтесь кнопкой обновления или обратитесь к администратору."


class BotButtons:
    # Un-sub & Sub buts
    INFO = "Информацияℹ"
    TARIFF = "Тариф📈"
    REFRESH = "Refresh🔁"

    # Sub buts
    DAYS_TO_EXPIRE = "Статус подписки📅"
    RENEW_SUBSCRIPTION = "Продлить подписку💵"

    # Owner buts
    STATS_FOR_OWNER = "Статистика📈"
    GET_SUB_INFO = "Информация о подписчике🐹"
    ADD_SUB = "Добавить подписчика✅"
    DEL_SUB = "Удалить подписчика❌"
    ADD_OWNER = "Добавить владельца✅"
    DEL_OWNER = "Удалить владельца❌"
